#include "support.h"
#include <iomanip>
#include <cstdio>
/*
support -> модуль ввода/вывода
Для файлового ввода/вывода используйте функции fprintf и fscanf.
-первичная поддержка пользователя, readme, переход на дальнейшие функции
Функции ввода/вывода НЕ должны применяться за пределами модуля ввода-вывода. По возможности стараться избегать дублирования кода,
например, код считывающий структуру с клавиатуры и из файла будет практически одинаковым,
подумайте, как организовать функции так, чтобы дублирование было минимально.
*/